# 使用进程池Pool

import os,time
from multiprocessing import Pool

def worker(arg):
    print("子进程开始执行>>> pid={0},ppid={1},编号{2}".format(os.getpid(),os.getppid(),arg))
    time.sleep(2)
    print("子进程终止>>> pid={},ppid={},编号{}".format(os.getpid(),os.getppid(),arg))

def main():
    print("主进程开始执行>>> pid={}".format(os.getpid()))
    ps=Pool(5)  # 异步执行时最多同时执行5个进程
    for i in range(10):
        ps.apply(worker,args=(i,))  # 同步执行
        # ps.apply_async(worker,args=(i,))  # 异步执行

    # 关闭进程池，停止接受其他进程
    ps.close()
    # 阻塞进程
    ps.join()

    print('主进程终止')

if __name__ == '__main__':
    main()

'''
异步执行结果：
主进程开始执行>>> pid=32824
子进程开始执行>>> pid=1380,ppid=32824,编号0
子进程开始执行>>> pid=26172,ppid=32824,编号2
子进程开始执行>>> pid=31216,ppid=32824,编号1
子进程开始执行>>> pid=26640,ppid=32824,编号3
子进程开始执行>>> pid=13728,ppid=32824,编号4
子进程终止>>> pid=1380,ppid=32824,编号0
子进程开始执行>>> pid=1380,ppid=32824,编号5
子进程终止>>> pid=26640,ppid=32824,编号3
子进程终止>>> pid=31216,ppid=32824,编号1
子进程终止>>> pid=26172,ppid=32824,编号2
子进程开始执行>>> pid=26640,ppid=32824,编号6
子进程终止>>> pid=13728,ppid=32824,编号4
子进程开始执行>>> pid=26172,ppid=32824,编号8
子进程开始执行>>> pid=31216,ppid=32824,编号7
子进程开始执行>>> pid=13728,ppid=32824,编号9
子进程终止>>> pid=1380,ppid=32824,编号5
子进程终止>>> pid=26172,ppid=32824,编号8
子进程终止>>> pid=26640,ppid=32824,编号6
子进程终止>>> pid=31216,ppid=32824,编号7
子进程终止>>> pid=13728,ppid=32824,编号9
主进程终止

同步执行结果:
主进程开始执行>>> pid=31856
子进程开始执行>>> pid=8900,ppid=31856,编号0
子进程终止>>> pid=8900,ppid=31856,编号0
子进程开始执行>>> pid=29024,ppid=31856,编号1
子进程终止>>> pid=29024,ppid=31856,编号1
子进程开始执行>>> pid=6080,ppid=31856,编号2
子进程终止>>> pid=6080,ppid=31856,编号2
子进程开始执行>>> pid=19088,ppid=31856,编号3
子进程终止>>> pid=19088,ppid=31856,编号3
子进程开始执行>>> pid=18612,ppid=31856,编号4
子进程终止>>> pid=18612,ppid=31856,编号4
子进程开始执行>>> pid=8900,ppid=31856,编号5
子进程终止>>> pid=8900,ppid=31856,编号5
子进程开始执行>>> pid=29024,ppid=31856,编号6
子进程终止>>> pid=29024,ppid=31856,编号6
子进程开始执行>>> pid=6080,ppid=31856,编号7
子进程终止>>> pid=6080,ppid=31856,编号7
子进程开始执行>>> pid=19088,ppid=31856,编号8
子进程终止>>> pid=19088,ppid=31856,编号8
子进程开始执行>>> pid=18612,ppid=31856,编号9
子进程终止>>> pid=18612,ppid=31856,编号9
主进程终止

'''